{
    "architectures": [
        "Qwen3MoeForCausalLM"
    ],
    "attention_dropout": 0.0,
    "decoder_sparse_step": 1,
    "eos_token_id": 151645,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 5472,
    "max_position_embeddings": 262144,
    "max_window_layers": 28,
    "mlp_only_layers": [],
    "model_type": "qwen3_moe",
    "moe_intermediate_size": 768,
    "norm_topk_prob": true,
    "num_attention_heads": 32,
    "num_experts": 128,
    "num_experts_per_tok": 8,
    "num_hidden_layers": 48,
    "num_key_value_heads": 4,
    "output_router_logits": false,
    "qkv_bias": false,
    "quantization": {
        "group_size": 64,
        "bits": 4,
        "model.layers.0.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.1.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.2.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.3.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.4.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.5.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.6.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.7.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.8.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.9.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.10.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.11.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.12.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.13.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.14.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.15.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.16.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.17.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.18.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.19.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.20.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.21.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.22.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.23.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.24.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.25.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.26.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.27.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.28.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.29.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.30.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.31.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.32.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.33.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.34.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.35.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.36.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.37.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.38.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.39.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.40.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.41.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.42.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.43.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.44.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.45.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.46.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.47.mlp.gate": {
            "group_size": 64,
            "bits": 8
        }
    },
    "quantization_config": {
        "group_size": 64,
        "bits": 4,
        "model.layers.0.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.1.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.2.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.3.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.4.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.5.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.6.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.7.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.8.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.9.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.10.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.11.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.12.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.13.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.14.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.15.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.16.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.17.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.18.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.19.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.20.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.21.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.22.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.23.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.24.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.25.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.26.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.27.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.28.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.29.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.30.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.31.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.32.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.33.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.34.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.35.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.36.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.37.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.38.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.39.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.40.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.41.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.42.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.43.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.44.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.45.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.46.mlp.gate": {
            "group_size": 64,
            "bits": 8
        },
        "model.layers.47.mlp.gate": {
            "group_size": 64,
            "bits": 8
        }
    },
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 10000000,
    "router_aux_loss_coef": 0.0,
    "shared_expert_intermediate_size": 0,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.52.3",
    "use_cache": true,
    "use_qk_norm": true,
    "use_sliding_window": false,
    "vocab_size": 151936
}