{
    "metadata": {
        "total_size": 17180913664,
        "total_parameters": 30532122624
    },
    "weight_map": {
        "lm_head.biases": "model-00004-of-00004.safetensors",
        "lm_head.scales": "model-00004-of-00004.safetensors",
        "lm_head.weight": "model-00004-of-00004.safetensors",
        "model.embed_tokens.biases": "model-00001-of-00004.safetensors",
        "model.embed_tokens.scales": "model-00001-of-00004.safetensors",
        "model.embed_tokens.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.switch_mlp.down_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.switch_mlp.down_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.switch_mlp.down_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.0.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.k_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.k_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.k_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.o_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.o_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.q_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.q_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.q_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.v_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.v_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.0.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.switch_mlp.down_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.switch_mlp.down_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.switch_mlp.down_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.1.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.k_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.k_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.k_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.o_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.o_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.q_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.q_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.q_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.v_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.v_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.1.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.switch_mlp.down_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.switch_mlp.down_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.switch_mlp.down_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.10.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.k_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.k_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.k_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.o_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.o_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.q_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.q_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.q_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.v_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.v_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.10.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.switch_mlp.down_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.switch_mlp.down_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.switch_mlp.down_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.11.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.k_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.k_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.k_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.o_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.o_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.q_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.q_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.q_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.v_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.v_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.11.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.switch_mlp.down_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.switch_mlp.down_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.switch_mlp.down_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.12.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.k_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.k_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.k_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.o_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.o_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.q_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.q_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.q_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.v_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.v_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.12.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.switch_mlp.down_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.switch_mlp.down_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.switch_mlp.down_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.13.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.k_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.k_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.k_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.o_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.o_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.q_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.q_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.q_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.v_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.v_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.13.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "model.layers.14.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "model.layers.14.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.14.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.14.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.14.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.14.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.14.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.14.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.14.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.k_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.k_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.k_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.o_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.o_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.q_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.q_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.q_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.v_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.v_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.14.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.15.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.15.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.15.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.16.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.16.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.17.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.17.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.18.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.18.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.19.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.19.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.2.input_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.gate.biases": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.gate.scales": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.gate.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.switch_mlp.down_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.switch_mlp.down_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.switch_mlp.down_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.switch_mlp.up_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.switch_mlp.up_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.2.mlp.switch_mlp.up_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.post_attention_layernorm.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.k_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.k_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.k_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.k_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.o_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.o_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.o_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.q_norm.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.q_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.q_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.q_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.v_proj.biases": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.v_proj.scales": "model-00001-of-00004.safetensors",
        "model.layers.2.self_attn.v_proj.weight": "model-00001-of-00004.safetensors",
        "model.layers.20.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.20.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.20.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.21.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.21.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.22.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.22.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.23.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.23.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.24.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.24.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.25.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.v_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.25.self_attn.v_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.input_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.gate.biases": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.gate.scales": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.gate.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.switch_mlp.down_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.switch_mlp.down_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.switch_mlp.down_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.switch_mlp.gate_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.switch_mlp.gate_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.switch_mlp.gate_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.switch_mlp.up_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.switch_mlp.up_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.26.mlp.switch_mlp.up_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.post_attention_layernorm.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.k_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.k_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.k_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.k_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.o_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.o_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.o_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.q_norm.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.q_proj.biases": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.q_proj.scales": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.q_proj.weight": "model-00002-of-00004.safetensors",
        "model.layers.26.self_attn.v_proj.biases": "model-00002-of-00004.safetensors",
